TestEDT/src/Documents/уа_ПереоценкаАмортизацияЦенныхБумаг/уа_ПереоценкаАмортизацияЦенныхБумаг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уа_ПереоценкаАмортизацияЦенныхБумаг</name>
  <registerRecords>AccountingRegister.ЕПС</registerRecords>
  <registerRecords>AccumulationRegister.уа_РасчетыПоЦеннымБумагам</registerRecords>
  <attributes>
    <name>Портфель</name>
    <type>
      <types>CatalogRef.Портфели</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценочнаяКатегория</name>
    <type>
      <types>EnumRef.уа_ОценочнаяКатегория</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Активы</name>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦеннаяБумага</name>
      <type>
        <types>CatalogRef.уа_ФинансовыеИнструменты</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>КратностьЦБ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсЦБ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАмортизации</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАмортизацииВал</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПереоценки</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПереоценкиВал</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>НКД</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>НКДВал</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаИндексацииНоминала</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаИндексацииНоминалаВал</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКорректировки</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКорректировкиВал</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TestEDT/src/Documents/уа_ПереоценкаАмортизацияЦенныхБумаг/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьСостояниеДокумента();

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьСостояниеДокумента();

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("КомментарийЗавершениеВвода", ЭтотОбъект); 
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(Оповещение, 
		Элемент.ТекстРедактирования,"Комментарий");

КонецПроцедуры

&НаКлиенте
Процедура КомментарийЗавершениеВвода(Знач ВведенныйТекст, Знач ДополнительныеПараметры) Экспорт
	
	Если ВведенныйТекст = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	Объект.Комментарий = ВведенныйТекст;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте 
Процедура Подключаемый_ВыполнитьКоманду(Команда)
          ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры 

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
          ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
          ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры 

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьСостояниеДокумента()
	      	
	Если Объект.РучнаяКорректировка = ИСТИНА Тогда
		Если Объект.ПометкаУдаления = ИСТИНА
			Тогда СостояниеДокумента = 10
		ИначеЕсли Объект.Проведен = ЛОЖЬ
			Тогда СостояниеДокумента = 9
		Иначе СостояниеДокумента = 8
		КонецЕсли;
	Иначе 
		Если Объект.ПометкаУдаления = ИСТИНА
			Тогда СостояниеДокумента = 2
		ИначеЕсли Объект.Проведен = ИСТИНА
			Тогда СостояниеДокумента = 1
		Иначе СостояниеДокумента = 0
		КонецЕсли; 		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	МоментВремени = Новый МоментВремени(Объект.Дата, Объект.Ссылка);
	ТЗ = уа_ОперативныйУчет.РассчитатьПереоценкуАмортизацию(МоментВремени, Объект.Портфель, Объект.ОценочнаяКатегория);
	Объект.Активы.Загрузить(ТЗ);
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры
#КонецОбласти
